package task15_1_1.zadanye1;

public class Task15_1_1 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 15. Поиск работы и продвинутые темы. Задание №1. Проект:\s
                Шаг 1:
                Создаём учётную запись
                Перейдите на сайт github.com, зарегистрируйтесь и верифицируйте адрес электронной
                почты. Выберите тип аккаунта: публичный или приватный. В публичном аккаунте
                репозитории видны всем, а в приватном — только тем участникам, которым вы
                сами открыли доступ.

                Решение:\s""");

        System.out.println("""
            Цитаты берём............
            \s""");


    }
}