package task15_1_1.zadanye5;

public class Task15_1_5 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 15. Поиск работы и продвинутые темы. Задание №1. Проект:
            Шаг 5:
            Создаём новую ветку и добавляем в проект внесённые изменения
            Добавим к проекту пустой CSS-файл и подключим его к HTML. После этого в меню редактора
            появятся два цвета: HTML-файл подсветится оранжевым, а CSS-файл — зелёным.
            Оранжевый означает, что файл уже есть в удалённом репозитории и его нужно обновить.
            Зелёный — файла нет в репозитории. Переходим в GitHub Desktop и добавляем коммит для этого изменения.
            Подсветка файлов в меню меняется после добавления или редактирования файлов — это подсказка,
            чтобы мы не забывали обновлять репозиторий:
            Если мы откроем созданную страницу в браузере, то это будет несколько строчек текста на
            белом фоне. Представим такую ситуацию: нам нельзя изменять код проекта, но нужно
            посмотреть, как будет выглядеть страница на красном фоне. Чтобы сделать это — добавим
            в репозиторий новую ветку:
            Переходим в GitHub Desktop.
            Открываем раздел Current Branch, нажимаем кнопку New Branch, пишем название новой ветки
            и кликаем Create New Branch.
            Возвращаемся в редактор кода и тестируем идею.
            После создания новой ветки не забудьте нажать на Push origin, чтобы изменения попали в
            удалённый репозиторий на сайте GitHub
            Создаём новую ветку в GitHub Desktop:
            Предположим, наша идея с красным фоном оказалась удачной
            и код нужно залить в основную ветку. Чтобы это сделать, переходим сайт GitHub, нажимаем кнопку
            Сompare & pull request и подтверждаем изменения кнопкой Merge pull request. Последний шаг —
            переходим в GitHub Desktop, кликаем Fetch origin и синхронизируемся с удалённым репозиторием.
            Теперь код из дополнительной ветки попал в основную, а изменения есть на ПК и в облаке..
            Для слияния веток нужно выполнить несколько подтверждений на GitHub:

            Решение:
        """);

        System.out.println("""
            Добавим..........
        """);
    }
}